jcvsite/solar-monitoring/esp32_display/src/main.cpp
#include <Arduino.h>
#include <math.h>
#include <time.h>
#include <vector>
#include <TFT_eSPI.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <SPI.h>

#include "config.h"
#include "secrets.h"
#include "settings_store.h"
#include "api_client.h"
#include "discovery.h"
#include "touch_input.h"
#include "lvgl_port.h"
#include "host_poll.h"
#include "ui.h"
#include "ui_lv.h"
#include "ui_lv/ui_actions.h"
#include "ui_lv/ui_shell.h"
#include "theme.h"
#include "layout.h"
#include "git_ota.h"
#include "device_web.h"
#include "wifi_setup.h"

#ifndef FW_VERSION
#define FW_VERSION "0.0.0"
#endif

TFT_eSPI tft;

SettingsStore store;
ApiClient api;
Discovery discovery;
UiLv ui;

HostSettings settings;
GlanceData glance;
BmsData bms;
HistoryData history;

UiPage page = UiPage::Glance;
UiSettingsTab settingsTab = UiSettingsTab::Connection;
uint32_t lastPoll = 0;
uint32_t lastConfigPoll = 0;
uint32_t lastGood = 0;
uint32_t lastAnim = 0;
String statusMsg = "Boot";
String otaStatus = "Ready";
bool needRedraw = true;
static bool s_pollAfterUi = false;
std::vector<DiscoveredHost> found;
int foundIndex = 0;
uint8_t manualOctets[4] = {192, 168, 1, 240};
uint8_t manualSel = 0;

std::vector<WifiNetwork> wifiNets;
int wifiScroll = 0;
int wifiSelected = 0;
String wifiPickSsid;
String wifiPassword;
bool wifiShowPass = false;
bool wifiShift = false;
String wifiStatus;

bool settingsPinUnlocked = false;
String pinEntry;
String pinStatus;
String pinSetFirst;
uint8_t pinSetPhase = 0;
UiPage pinReturnPage = UiPage::Glance;

static const char* kLayoutNames[] = {"Classic", "Compact", "Ring", "Bars", "Flow"};
static const char* kThemeNames[] = {"Dark", "Light", "Solar", "Ocean", "Forest"};

static void pollIfDue(bool force);
static void pollDisplayConfig(bool force);
static bool glanceGridAlert(const GlanceData& g);

static const char* rotationLabel(uint8_t r);
static void refreshCurrentPage();
static void handleUiAction(UiActionId id, const UiActionCtx& ctx);
static void openSettingsPage();
static void applyScreenRotation();
static uint32_t s_lastLocalRotateMs = 0;
static void startHostDiscovery();
static void openManualHost();
static void startWifiScan();
static bool ensureWifi(bool forcePortal);
static bool connectPickedWifi(const String& ssid, const String& pass);
static void showHostChoice();
static String manualOctetsToIp();
static void handlePinPadCommon(bool forSet);

static const char* rotationLabel(uint8_t r) {
  switch (r & 3) {
    case 1:
      return "Landscape";
    case 2:
      return "Portrait flip";
    case 3:
      return "Landscape flip";
    default:
      return "Portrait";
  }
}

static void refreshCurrentPage() {
  const bool stale = (lastGood == 0) || (millis() - lastGood > STALE_MS);
  switch (page) {
    case UiPage::Glance:
      ui.updateGlance(glance, stale, glanceGridAlert(glance), settings.glanceLayout);
      break;
    case UiPage::Bms:
      ui.updateBms(bms);
      break;
    case UiPage::History:
      ui.updateHistory(history);
      break;
    case UiPage::Settings:
    case UiPage::SettingsConn:
    case UiPage::SettingsUpdates:
      ui.updateSettings(settings, WiFi.status() == WL_CONNECTED, WiFi.SSID(),
                        settingsTab == UiSettingsTab::Updates ? otaStatus : statusMsg, otaStatus, settingsTab,
                        FW_VERSION);
      break;
    case UiPage::PickLayout:
      ui.showPickList("Layout", kLayoutNames, 5, settings.glanceLayout, false);
      break;
    case UiPage::PickTheme:
      ui.showPickList("Theme", kThemeNames, 5, settings.themeId, true);
      break;
    case UiPage::FindingHost:
      ui.showFindingHost(statusMsg);
      break;
    case UiPage::HostChoice:
      ui.showHostChoice(WiFi.SSID());
      break;
    case UiPage::ManualHost:
      ui.showManualHost(manualOctets, manualSel, settings.hostPort, statusMsg);
      break;
    case UiPage::WifiPick:
      ui.showWifiNetworks(wifiNets, wifiSelected, wifiStatus);
      break;
    case UiPage::WifiPassword:
      ui.showWifiPassword(wifiPickSsid, wifiPassword, wifiShowPass, wifiStatus);
      break;
    case UiPage::PinUnlock:
      ui.showPinPad("Settings locked", pinEntry, "Enter 4-digit PIN", pinStatus);
      break;
    case UiPage::PinSet:
      ui.showPinPad("Settings PIN", pinEntry, pinSetPhase ? "Confirm PIN" : "New PIN (4 digits)", pinStatus);
      break;
    default:
      break;
  }
}

static void handleUiAction(UiActionId id, const UiActionCtx& ctx) {
  switch (id) {
    case UiActionId::NavPage:
      settingsPinUnlocked = false;
      page = ctx.page;
      settingsTab = UiSettingsTab::Connection;
      // Paint first — never block the tap handler on HTTP (was up to 4s freeze).
      needRedraw = true;
      s_pollAfterUi = true;
      break;
    case UiActionId::OpenSettings:
      openSettingsPage();
      break;
    case UiActionId::PickLayout:
      settings.glanceLayout = (uint8_t)ctx.index;
      store.save(settings);
      page = UiPage::Settings;
      needRedraw = true;
      break;
    case UiActionId::PickTheme:
      settings.themeId = (uint8_t)ctx.index;
      ui.setTheme(settings.themeId);
      store.save(settings);
      page = UiPage::Settings;
      needRedraw = true;
      break;
    case UiActionId::RotateScreen: {
      static uint32_t lastRotBtn = 0;
      if (millis() - lastRotBtn < 750) break;
      lastRotBtn = millis();
      s_lastLocalRotateMs = millis();
      settings.screenRotation = (settings.screenRotation + 1) & 3;
      store.save(settings);
      applyScreenRotation();
      statusMsg = rotationLabel(settings.screenRotation);
      needRedraw = true;
      break;
    }
    case UiActionId::OpenPinSet:
      page = UiPage::PinSet;
      pinSetPhase = 0;
      pinSetFirst = "";
      pinEntry = "";
      pinStatus = "New PIN (4 digits)";
      needRedraw = true;
      break;
    case UiActionId::StartHostDiscovery:
      startHostDiscovery();
      break;
    case UiActionId::OpenManualHost:
      openManualHost();
      break;
    case UiActionId::StartWifiScan:
      page = UiPage::WifiPick;
      startWifiScan();
      break;
    case UiActionId::WifiRescan:
      startWifiScan();
      break;
    case UiActionId::WifiPhonePortal:
      statusMsg = "Opening phone portal...";
      needRedraw = true;
      if (ensureWifi(true)) {
        statusMsg = "WiFi OK " + WiFi.localIP().toString();
        page = UiPage::Settings;
      } else {
        statusMsg = "Portal cancelled";
      }
      needRedraw = true;
      break;
    case UiActionId::WifiPickNetwork:
      if (ctx.index >= 0 && ctx.index < (int)wifiNets.size()) {
        wifiSelected = ctx.index;
        wifiPickSsid = wifiNets[ctx.index].ssid;
        if (!wifiNets[ctx.index].secure) {
          if (connectPickedWifi(wifiPickSsid, "")) {
            statusMsg = wifiStatus;
            page = settings.hostIp.length() ? UiPage::Glance : UiPage::HostChoice;
          } else {
            page = UiPage::WifiPick;
          }
        } else {
          wifiPassword = "";
          wifiShowPass = false;
          wifiStatus = "Enter password";
          page = UiPage::WifiPassword;
        }
        needRedraw = true;
      }
      break;
    case UiActionId::WifiConnect: {
      wifiPassword = ui.getWifiPasswordInput();
      if (connectPickedWifi(wifiPickSsid, wifiPassword)) {
        statusMsg = wifiStatus;
        page = settings.hostIp.length() ? UiPage::Glance : UiPage::HostChoice;
      } else {
        page = UiPage::WifiPassword;
      }
      needRedraw = true;
      break;
    }
    case UiActionId::WifiBack:
      if (page == UiPage::WifiPassword) {
        page = UiPage::WifiPick;
        wifiStatus = "Tap your network";
      } else {
        page = UiPage::Settings;
        statusMsg = wifiStatus;
      }
      needRedraw = true;
      break;
    case UiActionId::HostChoiceDiscover:
      startHostDiscovery();
      break;
    case UiActionId::HostChoiceManual:
      openManualHost();
      break;
    case UiActionId::FindingHostCancel:
      showHostChoice();
      break;
    case UiActionId::ManualOctetSelect:
      manualSel = (uint8_t)ctx.index;
      needRedraw = true;
      break;
    case UiActionId::ManualOctetDec:
      manualOctets[manualSel] = (manualOctets[manualSel] == 0) ? 255 : manualOctets[manualSel] - 1;
      needRedraw = true;
      break;
    case UiActionId::ManualOctetInc:
      manualOctets[manualSel] = (manualOctets[manualSel] == 255) ? 0 : manualOctets[manualSel] + 1;
      needRedraw = true;
      break;
    case UiActionId::ManualPortDec:
      if (settings.hostPort > 1) settings.hostPort--;
      needRedraw = true;
      break;
    case UiActionId::ManualPortInc:
      if (settings.hostPort < 65535) settings.hostPort++;
      needRedraw = true;
      break;
    case UiActionId::ManualTest: {
      const String ip = manualOctetsToIp();
      statusMsg = "Testing...";
      needRedraw = true;
      String title;
      if (api.probeHost(ip, settings.hostPort, settings.token, title)) {
        statusMsg = title.length() ? title : "Host OK";
      } else {
        statusMsg = "Not reachable";
      }
      needRedraw = true;
      break;
    }
    case UiActionId::ManualSave:
      settings.hostIp = manualOctetsToIp();
      store.save(settings);
      deviceWeb.applySettings(settings);
      statusMsg = "Saved";
      page = UiPage::Glance;
      pollIfDue(true);
      needRedraw = true;
      break;
    case UiActionId::ManualBack:
      page = settings.hostIp.length() ? UiPage::Settings : UiPage::HostChoice;
      statusMsg = "";
      needRedraw = true;
      break;
    case UiActionId::ToggleCheckUpdate:
      settings.checkForUpdate = !settings.checkForUpdate;
      if (!settings.checkForUpdate) settings.autoInstallUpdate = false;
      store.save(settings);
      gitOta.configure(settings.hostIp, settings.hostPort, settings.token, settings.checkForUpdate,
                       settings.autoInstallUpdate);
      needRedraw = true;
      break;
    case UiActionId::ToggleAutoUpdate:
      settings.autoInstallUpdate = !settings.autoInstallUpdate;
      if (settings.autoInstallUpdate) settings.checkForUpdate = true;
      store.save(settings);
      gitOta.configure(settings.hostIp, settings.hostPort, settings.token, settings.checkForUpdate,
                       settings.autoInstallUpdate);
      needRedraw = true;
      break;
    case UiActionId::ToggleGridAlert:
      settings.gridOfflineAlert = !settings.gridOfflineAlert;
      store.save(settings);
      needRedraw = true;
      break;
    case UiActionId::ToggleUseHostConfig:
      settings.useHostConfig = !settings.useHostConfig;
      store.save(settings);
      if (settings.useHostConfig) pollDisplayConfig(true);
      needRedraw = true;
      break;
    case UiActionId::OtaCheckNow: {
      String st;
      gitOta.installLatest(st);
      otaStatus = st;
      needRedraw = true;
      break;
    }
    case UiActionId::PinDigit:
      if (pinEntry.length() < 4) {
        pinEntry += String(ctx.digit);
        if (page == UiPage::PinUnlock || page == UiPage::PinSet) ui.updatePinPad(pinEntry, pinStatus);
        if (pinEntry.length() == 4 && page == UiPage::PinUnlock) handlePinPadCommon(false);
      }
      break;
    case UiActionId::PinDelete:
      if (pinEntry.length()) pinEntry.remove(pinEntry.length() - 1);
      ui.updatePinPad(pinEntry, pinStatus);
      break;
    case UiActionId::PinOk:
      handlePinPadCommon(page == UiPage::PinSet);
      needRedraw = true;
      break;
    case UiActionId::PinBack:
      pinEntry = "";
      page = (page == UiPage::PinSet) ? UiPage::Settings : UiPage::Glance;
      needRedraw = true;
      break;
    default:
      break;
  }
}

static void startWifiScan() {
  wifiStatus = "Scanning...";
  needRedraw = true;
  ui.showWifiNetworks(wifiNets, wifiSelected, wifiStatus);
  if (wifiScanNetworks(wifiNets)) {
    wifiScroll = 0;
    wifiSelected = 0;
    wifiStatus = "Tap your network";
  } else {
    wifiNets.clear();
    wifiStatus = "No networks — tap Rescan";
  }
  needRedraw = true;
}

static bool connectPickedWifi(const String& ssid, const String& pass) {
  wifiStatus = "Connecting...";
  needRedraw = true;
  ui.setSplashMsg(wifiStatus.c_str());
  ui.tick();
  if (!wifiConnectAndSave(ssid.c_str(), pass.c_str())) {
    wifiStatus = "Failed — check password";
    return false;
  }
  wifiStatus = "Connected " + WiFi.localIP().toString();
  deviceWeb.applySettings(settings);
  deviceWeb.begin();
  ui.ensureClock();
  return true;
}

static bool nearEq(float a, float b) {
  if (isnan(a) && isnan(b)) return true;
  if (isnan(a) || isnan(b)) return false;
  return fabsf(a - b) < 1.0f;
}

static bool glanceVisualEqual(const GlanceData& a, const GlanceData& b) {
  return a.title == b.title && a.grid_state == b.grid_state && a.batt_status == b.batt_status &&
         a.batt_time == b.batt_time && a.status == b.status && nearEq(a.soc, b.soc) &&
         nearEq(a.batt_w, b.batt_w) && nearEq(a.pv_w, b.pv_w) && nearEq(a.load_w, b.load_w) &&
         nearEq(a.grid_w, b.grid_w) && nearEq(a.pv_today_kwh, b.pv_today_kwh) &&
         nearEq(a.load_today_kwh, b.load_today_kwh);
}

static bool glanceGridAlert(const GlanceData& g) {
  if (!settings.gridOfflineAlert) return false;
  return g.grid_state == "offline" || g.grid_state == "brownout";
}

