jcvsite/solar-monitoring/esp32_display/src/main.cpp
static void loadManualOctetsFromSettings() {
  if (settings.hostIp.length()) {
    int start = 0;
    for (int i = 0; i < 4; i++) {
      int dot = settings.hostIp.indexOf('.', start);
      String part = (dot >= 0) ? settings.hostIp.substring(start, dot) : settings.hostIp.substring(start);
      manualOctets[i] = (uint8_t)constrain(part.toInt(), 0, 255);
      if (dot < 0) break;
      start = dot + 1;
    }
  } else {
    IPAddress lip = WiFi.localIP();
    manualOctets[0] = 192;
    manualOctets[1] = 168;
    manualOctets[2] = 1;
    manualOctets[3] = 240;
    if (lip != IPAddress((uint32_t)0)) {
      manualOctets[0] = lip[0];
      manualOctets[1] = lip[1];
      manualOctets[2] = lip[2];
    }
  }
}

static String manualOctetsToIp() {
  char buf[16];
  snprintf(buf, sizeof(buf), "%u.%u.%u.%u", manualOctets[0], manualOctets[1], manualOctets[2], manualOctets[3]);
  return String(buf);
}

static void showHostChoice() {
  discovery.cancelSearch();
  page = UiPage::HostChoice;
  statusMsg = "";
  needRedraw = true;
}

static void openManualHost() {
  discovery.cancelSearch();
  loadManualOctetsFromSettings();
  manualSel = 0;
  page = UiPage::ManualHost;
  statusMsg = "Tap octet, use +/-";
  needRedraw = true;
}

static void startHostDiscovery() {
  found.clear();
  discovery.cancelSearch();
  discovery.beginSearch(settings.hostPort);
  page = UiPage::FindingHost;
  statusMsg = "Searching...";
  needRedraw = true;
}

static void finishHostDiscovery() {
  if (!found.empty()) {
    foundIndex = 0;
    settings.hostIp = found[0].ip;
    settings.hostPort = found[0].port;
    store.save(settings);
    statusMsg = "Found " + settings.hostIp;
    page = UiPage::Glance;
    pollIfDue(true);
  } else {
    statusMsg = "Not found";
    showHostChoice();
  }
  needRedraw = true;
}

static const char* kApNameBase = WIFI_SETUP_AP_NAME;

static String uniqueApName() {
  uint32_t id = (uint32_t)ESP.getEfuseMac();
  char buf[40];
  snprintf(buf, sizeof(buf), "%s-%04X", kApNameBase, (unsigned)(id & 0xFFFF));
  return String(buf);
}

static String uniqueHostname() {
  uint32_t id = (uint32_t)ESP.getEfuseMac();
  char buf[32];
  snprintf(buf, sizeof(buf), "esp32-solar-%06X", (unsigned)(id & 0xFFFFFF));
  return String(buf);
}

static void setBrightness(uint8_t v) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(TFT_BL, 5000, 8);
  ledcWrite(TFT_BL, v);
#else
  ledcSetup(0, 5000, 8);
  ledcAttachPin(TFT_BL, 0);
  ledcWrite(0, v);
#endif
}

static void applyScreenRotation() {
  settings.screenRotation = (uint8_t)constrain(settings.screenRotation, (int)0, (int)3);
  tft.setRotation(settings.screenRotation);
  touchInputSetRotation(settings.screenRotation);
  ui.setRotation(settings.screenRotation);
}

static String gPortalApName;

static void configModeCallback(WiFiManager* wm) {
  (void)wm;
  ui.showWifiPortal(gPortalApName.c_str());
}

static bool ensureWifi(bool forcePortal) {
  WiFi.mode(WIFI_STA);
  gPortalApName = uniqueApName();
  String hostname = uniqueHostname();

  String seedSsid = WIFI_SSID;
  String seedPass = WIFI_PASSWORD;
  bool seedOk = seedSsid.length() > 0 && seedSsid != "YourWiFiSSID";

  WiFiManager wm;
  wm.setDebugOutput(false);
  wm.setConfigPortalTimeout(300);
  wm.setConnectTimeout(30);
  wm.setAPCallback(configModeCallback);
  wm.setTitle("Solar Display WiFi");
  wm.setHostname(hostname.c_str());
  wm.setCustomHeadElement(
      "<meta name='viewport' content='width=device-width,initial-scale=1'>"
      "<style>"
      "body{font-family:system-ui,sans-serif;background:#111;color:#eee;padding:12px;max-width:420px;margin:auto}"
      "input,select{font-size:18px;padding:12px;width:100%;box-sizing:border-box;margin:8px 0;"
      "border-radius:8px;border:1px solid #444;background:#1c1c1e;color:#fff}"
      "button,.btn{font-size:18px;padding:12px 16px;border-radius:8px;border:0;background:#0a84ff;color:#fff;"
      "width:100%;margin-top:12px;cursor:pointer}"
      "h1{font-size:1.35rem} label{font-weight:600;display:block;margin-top:10px}"
      ".msg{padding:10px;border-radius:8px;background:#1c1c1e;margin:10px 0}"
      "</style>");

  if (forcePortal) {
    ui.showWifiPortal(gPortalApName.c_str());
    bool ok = wm.startConfigPortal(gPortalApName.c_str());
    return ok && WiFi.status() == WL_CONNECTED;
  }

  ui.setSplashMsg("WiFi...");
  ui.tick();
  bool ok = false;
  if (seedOk) {
    ok = wm.autoConnect(gPortalApName.c_str(), NULL);
    if (!ok) {
      WiFi.begin(seedSsid.c_str(), seedPass.c_str());
      uint32_t t0 = millis();
      while (WiFi.status() != WL_CONNECTED && millis() - t0 < 12000) {
        lvglPortTick();
        delay(20);
      }
      ok = WiFi.status() == WL_CONNECTED;
      if (!ok) {
        ui.showWifiPortal(gPortalApName.c_str());
        ok = wm.startConfigPortal(gPortalApName.c_str());
      }
    }
  } else {
    ok = wm.autoConnect(gPortalApName.c_str());
  }
  return ok && WiFi.status() == WL_CONNECTED;
}

static bool pinIsSet() { return settings.settingsPin.length() == 4; }

static void openSettingsPage() {
  if (pinIsSet() && !settingsPinUnlocked) {
    page = UiPage::PinUnlock;
    pinEntry = "";
    pinStatus = "Enter PIN";
    pinReturnPage = UiPage::Settings;
    needRedraw = true;
    return;
  }
  page = UiPage::Settings;
  settingsTab = UiSettingsTab::Connection;
  settingsPinUnlocked = true;
  needRedraw = true;
  s_pollAfterUi = true;
}

static void handlePinPadCommon(bool forSet) {
  if (forSet) {
    if (pinEntry.length() == 0) {
      settings.settingsPin = "";
      store.save(settings);
      deviceWeb.applySettings(settings);
      pinSetPhase = 0;
      pinSetFirst = "";
      pinStatus = "PIN disabled";
      page = UiPage::Settings;
      needRedraw = true;
      return;
    }
    if (pinEntry.length() != 4) return;
    if (pinSetPhase == 0) {
      pinSetFirst = pinEntry;
      pinEntry = "";
      pinSetPhase = 1;
      pinStatus = "Confirm PIN";
      needRedraw = true;
      return;
    }
    if (pinEntry != pinSetFirst) {
      pinEntry = "";
      pinSetPhase = 0;
      pinSetFirst = "";
      pinStatus = "No match — retry";
      needRedraw = true;
      return;
    }
    settings.settingsPin = pinEntry;
    store.save(settings);
    deviceWeb.applySettings(settings);
    pinEntry = "";
    pinSetPhase = 0;
    pinSetFirst = "";
    pinStatus = "PIN saved";
    page = UiPage::Settings;
    needRedraw = true;
    return;
  }
  if (pinEntry.length() != 4) return;
  if (pinEntry == settings.settingsPin) {
    settingsPinUnlocked = true;
    pinEntry = "";
    page = pinReturnPage;
    pinStatus = "";
    needRedraw = true;
  } else {
    pinEntry = "";
    pinStatus = "Wrong PIN";
    needRedraw = true;
  }
}

static void applyHostSettingsFromConfig(const DisplayConfig& cfg) {
  bool changed = false;
  if (cfg.config_rev > settings.configRev) {
    settings.configRev = cfg.config_rev;
    changed = true;
  }
  if (settings.glanceLayout != cfg.glance_layout) {
    settings.glanceLayout = cfg.glance_layout;
    changed = true;
  }
  if (settings.themeId != cfg.theme) {
    settings.themeId = cfg.theme;
    ui.setTheme(settings.themeId);
    changed = true;
  }
  if (settings.screenRotation != cfg.rotation) {
    // Don't yank orientation right after a local rotate (stops portrait/landscape fight).
    if (s_lastLocalRotateMs != 0 && millis() - s_lastLocalRotateMs < 120000) {
      // keep local
    } else {
      settings.screenRotation = cfg.rotation;
      applyScreenRotation();
      changed = true;
    }
  }
  if (settings.brightness != cfg.brightness) {
    settings.brightness = cfg.brightness;
    setBrightness(settings.brightness);
    changed = true;
  }
  if (settings.pollMs != cfg.poll_ms) {
    settings.pollMs = cfg.poll_ms;
    changed = true;
  }
  if (settings.checkForUpdate != cfg.check_for_update) {
    settings.checkForUpdate = cfg.check_for_update;
    changed = true;
  }
  if (settings.autoInstallUpdate != cfg.auto_install_update) {
    settings.autoInstallUpdate = cfg.auto_install_update;
    changed = true;
  }
  if (settings.gridOfflineAlert != cfg.grid_offline_alert) {
    settings.gridOfflineAlert = cfg.grid_offline_alert;
    changed = true;
  }
  if (settings.useHostConfig && cfg.settings_pin != settings.settingsPin) {
    settings.settingsPin = cfg.settings_pin;
    changed = true;
  }
  gitOta.configure(settings.hostIp, settings.hostPort, settings.token, settings.checkForUpdate,
                   settings.autoInstallUpdate);
  if (changed) {
    store.save(settings);
    deviceWeb.applySettings(settings);
    needRedraw = true;
  }
  if (cfg.force_update) {
    String st;
    gitOta.installLatest(st);
    otaStatus = st;
  }
}

static void pollDisplayConfig(bool force) {
  if (!settings.useHostConfig) return;
  if (!force && millis() - lastConfigPoll < 30000) return;
  lastConfigPoll = millis();
  if (settings.hostIp.length() == 0 || WiFi.status() != WL_CONNECTED) return;
  DisplayConfig cfg;
  if (api.fetchDisplayConfig(settings.hostIp, settings.hostPort, settings.token, cfg)) {
    applyHostSettingsFromConfig(cfg);
  }
}

