jcvsite/solar-monitoring/esp32_display/src/main.cpp
static void applyHostPollResults() {
  GlanceData g;
  if (hostPollTakeGlance(g)) {
    if (g.tz_offset_sec >= -43200 && g.tz_offset_sec <= 50400) {
      ui.syncClockTimezone(g.tz_offset_sec);
    }
    bool headerChanged = (g.clock != glance.clock) || (g.weather_enabled != glance.weather_enabled) ||
                         (g.weather_code != glance.weather_code) || (g.weather_temp != glance.weather_temp);
    if (!glanceVisualEqual(glance, g)) {
      glance = g;
      needRedraw = true;
    } else {
      glance = g;
      if (page == UiPage::Glance && headerChanged) ui.refreshHeaderTime(glance);
    }
    lastGood = millis();
  }
  BmsData b;
  if (hostPollTakeBms(b)) {
    bms = b;
    lastGood = millis();
    if (page == UiPage::Bms) needRedraw = true;
  }
  HistoryData h;
  if (hostPollTakeHistory(h)) {
    history = h;
    lastGood = millis();
    if (page == UiPage::History) needRedraw = true;
  }
}

static void pollIfDue(bool force) {
  if (!force && millis() - lastPoll < settings.pollMs) return;
  if (!force && hostPollBusy()) return;
  lastPoll = millis();
  if (settings.hostIp.length() == 0 || WiFi.status() != WL_CONNECTED) return;
  // Non-blocking: FreeRTOS worker does HTTP; UI just applies results later.
  hostPollRequest(page, force);
}

void setup() {
  Serial.begin(115200);
  delay(200);
  store.begin();
  settings = store.load();
  hostPollBegin(&api, &settings);

  themeSetActive(settings.themeId);
  touchInputBegin();

  tft.init();
  settings.screenRotation = (uint8_t)constrain(settings.screenRotation, (int)0, (int)3);
  tft.setRotation(settings.screenRotation);
  touchInputSetRotation(settings.screenRotation);
  setBrightness(settings.brightness);
  ui.begin(tft, settings.screenRotation);
  ui.setTheme(settings.themeId);
  uiActionsSetHandler(handleUiAction);
  ui.showSplash("Starting...");
  ui.tick();

  gitOta.begin();
  gitOta.configure(settings.hostIp, settings.hostPort, settings.token, settings.checkForUpdate,
                   settings.autoInstallUpdate);

  if (ensureWifi(false)) {
    ui.setSplashMsg(WiFi.localIP().toString().c_str());
    ui.tick();
    deviceWeb.applySettings(settings);
    deviceWeb.begin();
    ui.ensureClock();
    {
      struct tm ti;
      uint32_t t0 = millis();
      while (millis() - t0 < 3000) {
        lvglPortTick();
        if (getLocalTime(&ti)) break;
        delay(20);
      }
    }
    delay(400);
  } else {
    page = UiPage::WifiPick;
    startWifiScan();
    delay(400);
  }

  if (page != UiPage::WifiPick && page != UiPage::WifiPassword) {
    page = UiPage::Glance;
    statusMsg = settings.hostIp;
  }

  pollDisplayConfig(true);
  pollIfDue(true);
  refreshCurrentPage();
  needRedraw = false;
}

void loop() {
  ui.tick();

  const int swipe = lvglPortConsumeSwipe();
  if (swipe != 0) {
    uiShellSwipePage(swipe);
  }

  if (gDeviceWebSaved) {
    gDeviceWebSaved = false;
    const uint8_t prevRot = settings.screenRotation;
    settings = deviceWeb.settings();
    store.save(settings);
    if (settings.screenRotation != prevRot) {
      s_lastLocalRotateMs = millis();
      applyScreenRotation();
    }
    ui.setTheme(settings.themeId);
    setBrightness(settings.brightness);
    needRedraw = true;
  }

  deviceWeb.loop();
  gitOta.loop();
  otaStatus = gitOta.status();

  if (page == UiPage::FindingHost && discovery.isSearching()) {
    if (discovery.tickSearch(api, settings.token, found)) {
      finishHostDiscovery();
    }
  }

  static bool wasStale = false;
  const bool stale = (lastGood == 0) || (millis() - lastGood > STALE_MS);
  if (stale != wasStale) {
    wasStale = stale;
    needRedraw = true;
  }

  pollIfDue(false);
  pollDisplayConfig(false);

  static uint32_t lastClock = 0;
  if (page == UiPage::Glance && WiFi.status() == WL_CONNECTED && millis() - lastClock >= 30000) {
    lastClock = millis();
    ui.ensureClock();
    ui.refreshHeaderTime(glance);
  }

  if (page == UiPage::Glance && glanceGridAlert(glance) && millis() - lastAnim >= 5000) {
    lastAnim = millis();
    ui.pulseGlanceGrid(true, millis());
  }

  static uint32_t lastBattAnim = 0;
  if (page == UiPage::Glance && millis() - lastBattAnim >= 120) {
    lastBattAnim = millis();
    ui.animateGlanceBattery(glance, millis());
  }

  applyHostPollResults();

  if (needRedraw) {
    needRedraw = false;
    refreshCurrentPage();
    lvglPortResetInput();
  }
  // Kick HTTP only after the new page painted (worker task; never blocks UI).
  if (s_pollAfterUi) {
    s_pollAfterUi = false;
    pollIfDue(true);
  }

  delay(5);
}
